{
    "statements": [
        {
            "id": 0,
            "text": "The Indo-European languages form a large family spread across Europe and parts of Asia, including well-known Romance languages, Germanic languages, and Slavic languages."
        },
        {
            "id": 1,
            "text": "Romance languages grew out of spoken Latin, and they share many similar verb endings and word order patterns that distinguish them within the Indo-European languages."
        },
        {
            "id": 2,
            "text": "Germanic languages, another branch of the Indo-European languages, are known for their strong and weak verb patterns and for having shifted many consonant sounds in history."
        },
        {
            "id": 3,
            "text": "Slavic languages are a subgroup of the Indo-European languages that often mark grammatical case with rich endings on nouns and adjectives."
        },
        {
            "id": 4,
            "text": "Sino-Tibetan languages, which include many tonal systems, are unrelated genetically to the Indo-European languages even though speakers may now live side by side in many cities."
        },
        {
            "id": 5,
            "text": "Semitic languages, usually classified inside the larger Afro-Asiatic family, are distinct from the Indo-European languages in their use of consonant roots and vowel patterns to form words."
        },
        {
            "id": 6,
            "text": "Many Romance languages use gendered noun systems, while Germanic languages have simplified gender in some cases but still show it in pronouns and certain articles."
        },
        {
            "id": 7,
            "text": "In Slavic languages, aspect is central to the verb system, contrasting with the tense-focused patterns more common in many Romance languages and Germanic languages."
        },
        {
            "id": 8,
            "text": "Sino-Tibetan languages often rely on word order and particles more than inflectional endings, making them typologically quite different from Slavic languages and Romance languages."
        },
        {
            "id": 9,
            "text": "Semitic languages frequently build related words from the same three-consonant root, a strategy much less common in Romance languages or Germanic languages."
        },
        {
            "id": 10,
            "text": "Many creole languages arise where speakers of different Romance languages, Germanic languages, or Semitic languages have long-term contact under trade or colonial conditions."
        },
        {
            "id": 11,
            "text": "Creole languages often simplify some features of their source Romance languages or Germanic languages while developing their own stable grammar and vocabulary."
        },
        {
            "id": 12,
            "text": "Sign languages are full languages in their own right, not visual versions of nearby Romance languages or Germanic languages, and they have their own families and histories."
        },
        {
            "id": 13,
            "text": "Different sign languages may coexist in the same country where Indo-European languages or Sino-Tibetan languages are spoken as dominant spoken tongues."
        },
        {
            "id": 14,
            "text": "Some Indo-European languages are written in alphabets borrowed from Semitic languages, illustrating how writing systems can spread independently of language families."
        },
        {
            "id": 15,
            "text": "Word order in Germanic languages often places the verb in second position in main clauses, unlike the more rigid subject–verb–object patterns favored by many Romance languages and Sino-Tibetan languages."
        },
        {
            "id": 16,
            "text": "Tone is a key contrast in many Sino-Tibetan languages but is rare in most Indo-European languages, even though some Slavic languages and Germanic languages show pitch accents."
        },
        {
            "id": 17,
            "text": "Borrowing between Romance languages and Germanic languages has created large shared vocabularies, especially in fields like science and technology."
        },
        {
            "id": 18,
            "text": "In multilingual regions, speakers may switch between a local creole language and a nearby Romance language or Indo-European standard language depending on social setting."
        },
        {
            "id": 19,
            "text": "Slavic languages often use aspect and prefixes to create verb pairs, while Romance languages and Sino-Tibetan languages may rely more on separate adverbs or particles to express similar distinctions."
        },
        {
            "id": 20,
            "text": "Semitic languages and Indo-European languages have both spread widely through religion, trade, and conquest, so their speakers now share many contact zones with Romance languages and Slavic languages."
        },
        {
            "id": 21,
            "text": "Some sign languages have borrowed finger-spelling alphabets from Indo-European languages while keeping sign vocabulary and grammar independent."
        },
        {
            "id": 22,
            "text": "Germanic languages contributed many everyday words to some creole languages, especially in places where Germanic-speaking powers once dominated trade routes."
        },
        {
            "id": 23,
            "text": "Romance languages and Slavic languages are often taught side by side in European schools, illustrating how different branches of the Indo-European languages are grouped in education."
        },
        {
            "id": 24,
            "text": "The classification of Sino-Tibetan languages continues to be refined as linguists compare sound systems and vocabularies with those of Indo-European languages and other families."
        },
        {
            "id": 25,
            "text": "Semitic languages share features like emphatic consonants and templatic morphology, which set them apart from both Indo-European languages and Sino-Tibetan languages."
        },
        {
            "id": 26,
            "text": "Many creole languages are now gaining official recognition alongside Indo-European languages or Sino-Tibetan languages in school systems and legal documents."
        },
        {
            "id": 27,
            "text": "Some sign languages have regional variants influenced by nearby Romance languages, Germanic languages, or Slavic languages, especially through mouthings and borrowed names."
        },
        {
            "id": 28,
            "text": "Romance languages, Germanic languages, and Slavic languages all show evidence of historical sound changes, but each subgroup within the Indo-European languages has its own characteristic shifts."
        },
        {
            "id": 29,
            "text": "In language typology, Indo-European languages, Semitic languages, and Sino-Tibetan languages are often compared to test how grammatical categories like tense or aspect can develop independently in different families."
        },
        {
            "id": 30,
            "text": "Romance languages often use prepositions and fixed word order to mark grammatical relationships, whereas Slavic languages rely more on case endings for the same roles."
        },
        {
            "id": 31,
            "text": "Many Germanic languages have borrowed religious and scholarly terms from Semitic languages and Romance languages via sacred texts and medieval learning."
        },
        {
            "id": 32,
            "text": "Speakers of Indo-European languages may find it challenging to learn Sino-Tibetan languages or sign languages at first because tone or visual-spatial grammar feels very different from familiar patterns."
        },
        {
            "id": 33,
            "text": "Creole languages show that new grammatical systems can emerge quickly when speakers of Indo-European languages, Semitic languages, or Sino-Tibetan languages need a shared medium for everyday communication."
        },
        {
            "id": 34,
            "text": "Some Romance languages and Germanic languages are now global lingua francas, shaping how creole languages and even distant Sino-Tibetan languages borrow new technical terms."
        },
        {
            "id": 35,
            "text": "Slavic languages, Germanic languages, and Romance languages are all used to translate scientific research, while sign languages adapt key terms into visual forms for deaf communities."
        },
        {
            "id": 36,
            "text": "In comparative linguistics, Indo-European languages often serve as a reference family when describing how creole languages deviate from or align with older grammatical patterns."
        },
        {
            "id": 37,
            "text": "Some school curricula treat sign languages, creole languages, and Indo-European languages as equally valid forms of communication, moving away from older hierarchies."
        },
        {
            "id": 38,
            "text": "Workshops for language teachers may bring together specialists in Romance languages, Slavic languages, and Sino-Tibetan languages to share strategies for explaining unfamiliar sound systems to students."
        },
        {
            "id": 39,
            "text": "Linguistic atlases sometimes color-code Indo-European languages, Sino-Tibetan languages, and Semitic languages on world maps to show where each family is dominant."
        },
        {
            "id": 40,
            "text": "Community language festivals might feature songs in Romance languages and Germanic languages, storytelling in creole languages, and poetry in sign languages on the same stage."
        },
        {
            "id": 41,
            "text": "In online spaces, speakers of Sino-Tibetan languages, Romance languages, and Germanic languages create shared slang, while creole languages develop their own creative styles in video and chat."
        }
    ],
    "entities": [
        {
            "id": 0,
            "name": "Indo-European languages"
        },
        {
            "id": 1,
            "name": "Romance languages"
        },
        {
            "id": 2,
            "name": "Germanic languages"
        },
        {
            "id": 3,
            "name": "Slavic languages"
        },
        {
            "id": 4,
            "name": "Sino-Tibetan languages"
        },
        {
            "id": 5,
            "name": "Semitic languages"
        },
        {
            "id": 6,
            "name": "creole languages"
        },
        {
            "id": 7,
            "name": "sign languages"
        }
    ],
    "entity_statements": {
        "0": [
            0,
            1,
            2,
            3,
            4,
            5,
            13,
            14,
            16,
            18,
            20,
            21,
            23,
            24,
            25,
            26,
            28,
            29,
            32,
            33,
            36,
            37,
            39
        ],
        "1": [
            0,
            1,
            6,
            7,
            8,
            9,
            10,
            11,
            12,
            15,
            17,
            18,
            19,
            20,
            23,
            27,
            28,
            30,
            31,
            34,
            35,
            38,
            40,
            41
        ],
        "2": [
            0,
            2,
            6,
            7,
            9,
            10,
            11,
            12,
            15,
            16,
            17,
            22,
            27,
            28,
            31,
            34,
            35,
            40,
            41
        ],
        "3": [
            0,
            3,
            7,
            8,
            16,
            19,
            20,
            23,
            27,
            28,
            30,
            35,
            38
        ],
        "4": [
            4,
            8,
            13,
            15,
            16,
            19,
            24,
            25,
            26,
            29,
            32,
            33,
            34,
            38,
            39,
            41
        ],
        "5": [
            5,
            9,
            10,
            14,
            20,
            25,
            29,
            31,
            33,
            39
        ],
        "6": [
            10,
            11,
            18,
            22,
            26,
            33,
            34,
            36,
            37,
            40,
            41
        ],
        "7": [
            12,
            13,
            21,
            27,
            32,
            35,
            37,
            40
        ]
    }
}