{
    "statements": [
        {
            "id": 0,
            "text": "The Odyssey is sung as the tale of Odysseus, the resourceful man who wandered long from Troy over the wine-dark sea while yearning always for his distant home of Ithaca."
        },
        {
            "id": 1,
            "text": "At Troy, Odysseus is praised among the Achaean chiefs for his cunning counsel in council and his calm skill in ambush rather than for sheer size or brute strength."
        },
        {
            "id": 2,
            "text": "Poseidon, shaker of the earth, broods in rage over the blinding of his Cyclops son Polyphemus and lashes the seas with storms against the returning ships of the Achaeans."
        },
        {
            "id": 3,
            "text": "In the shadowed cave of Polyphemus, Odysseus tricks the Cyclops with strong wine, calls himself 'Nobody', and escapes with his companions by clinging beneath the monster's sheep."
        },
        {
            "id": 4,
            "text": "On the remote island of Calypso, Odysseus sits weeping on the shore for Ithaca while the goddess offers him a deathless life if he will forget his home."
        },
        {
            "id": 5,
            "text": "In the councils of the gods, Athena speaks kindly of Odysseus and urges that he be allowed to return to Ithaca, even while Poseidon alone refuses to lay aside his wrath."
        },
        {
            "id": 6,
            "text": "In the halls of Ithaca, Telemachus grows from a shy boy into a bold speaker as Athena, in disguise, urges him to confront the suitors who devour his inheritance."
        },
        {
            "id": 7,
            "text": "Penelope delays marriage by weaving a shroud for Laertes by day and secretly unweaving it at night, so that the suitors never see the promised work completed."
        },
        {
            "id": 8,
            "text": "In the megaron of Ithaca, the suitors feast on rich meats, drink wine without measure, and mock Telemachus as they lounge upon the benches of another man's house."
        },
        {
            "id": 9,
            "text": "Shipwrecked and salt-encrusted, Odysseus is found by Nausicaa on the shore of Phaeacia, where the compassionate princess gives him clothing and guides him toward the palace of King Alcinous."
        },
        {
            "id": 10,
            "text": "In the bright halls of Alcinous in Phaeacia, Odysseus listens to a bard sing of the Trojan War, weeps at the memories, and is finally moved to declare his name and recount the adventures that make up the Odyssey of his return."
        },
        {
            "id": 11,
            "text": "On the island of Circe, some of Odysseus's companions are turned into swine by the enchantress, yet with divine help he overcomes her spells and wins a year of shelter and counsel in her halls."
        },
        {
            "id": 12,
            "text": "To pass the island of the Sirens, Odysseus has his crew stop their ears with wax and binds himself upright to the mast so that he alone may hear the deadly song and yet survive."
        },
        {
            "id": 13,
            "text": "At the narrow strait of Scylla and Charybdis, Odysseus steers close to the cliff of the six-headed monster and sacrifices several sailors rather than risk his whole ship in the gaping whirlpool."
        },
        {
            "id": 14,
            "text": "In distant lands, storytellers praise Penelope for her steadfast mind, saying that no other queen could match her patience under the insolence of so many suitors."
        },
        {
            "id": 15,
            "text": "Seeking news of his absent father, Telemachus leaves Ithaca by ship, visits distant kings, and learns how the fame of a warrior can be preserved by loyal kin or erased by forgetful households."
        },
        {
            "id": 16,
            "text": "Guided by Athena, Odysseus at last reaches Ithaca disguised as a ragged beggar, so that he may walk unrecognized among the suitors and test the faithfulness of those who still dwell in his house."
        },
        {
            "id": 17,
            "text": "On a dung heap by the gates of Ithaca, the old hound Argos lifts his head, recognizes Odysseus beneath the beggar's rags, wags his tail once, and dies where he lies."
        },
        {
            "id": 18,
            "text": "When the time of vengeance comes, Odysseus stands in the doorway of his hall, casts off the beggar's disguise, and with Telemachus and Athena's favor looses arrows and spear until the suitors lie in heaps upon the floor."
        },
        {
            "id": 19,
            "text": "Even after the slaughter of the suitors, Penelope tests Odysseus by speaking of moving their marriage bed, and she knows him at last when he protests that the bed is rooted in a living olive tree and cannot be shifted."
        },
        {
            "id": 20,
            "text": "Greek sailors tell tales of Calypso and Circe as dangerous hostesses, one who would keep a man forever in soft exile and one who can turn a crew into beasts with a flick of her wand."
        },
        {
            "id": 21,
            "text": "The Sirens, Scylla, and Charybdis are named together in seafaring songs as perils that haunt a single stretch of water, promising sweet music, sudden snatching jaws, and a swallowing whirlpool to any ship that passes unwarned."
        },
        {
            "id": 22,
            "text": "Nausicaa, daughter of Alcinous, is praised in Phaeacia for her modesty and courage, since she dares to meet a stranger on the shore and offer him aid when other maidens flee."
        },
        {
            "id": 23,
            "text": "On his lonely farm outside Ithaca, Laertes lives in rough clothes and sleeps on the ground, grieving for a son he believes lost at sea and finding comfort only in tending his trees."
        },
        {
            "id": 24,
            "text": "Argos, once the finest hunting hound in Ithaca, lies neglected on a pile of dung, covered in fleas, yet still keeps one ear tuned for the familiar footsteps that never seem to come."
        },
        {
            "id": 25,
            "text": "Throughout the Odyssey, Athena shows special favor to Ithaca, encouraging Telemachus to speak boldly in assembly and strengthening Penelope to endure many years of uncertainty."
        },
        {
            "id": 26,
            "text": "After their deaths, the suitors of Ithaca are remembered not as noble wooers but as men who abused guest-right, squandered another family's wealth, and met a bloody end in the very hall they had polluted."
        },
        {
            "id": 27,
            "text": "Among the many stories told after the fall of Troy, the Odyssey stands out as the song of a single household in Ithaca and of the long delay between a warrior's departure and the final restoration of his home."
        }
    ],
    "entities": [
        {
            "id": 0,
            "name": "Odysseus"
        },
        {
            "id": 1,
            "name": "Penelope"
        },
        {
            "id": 2,
            "name": "Telemachus"
        },
        {
            "id": 3,
            "name": "Athena"
        },
        {
            "id": 4,
            "name": "Poseidon"
        },
        {
            "id": 5,
            "name": "Calypso"
        },
        {
            "id": 6,
            "name": "Circe"
        },
        {
            "id": 7,
            "name": "Polyphemus"
        },
        {
            "id": 8,
            "name": "Sirens"
        },
        {
            "id": 9,
            "name": "Scylla"
        },
        {
            "id": 10,
            "name": "Charybdis"
        },
        {
            "id": 11,
            "name": "Nausicaa"
        },
        {
            "id": 12,
            "name": "Alcinous"
        },
        {
            "id": 13,
            "name": "Ithaca"
        },
        {
            "id": 14,
            "name": "Troy"
        },
        {
            "id": 15,
            "name": "Phaeacia"
        },
        {
            "id": 16,
            "name": "Laertes"
        },
        {
            "id": 17,
            "name": "the suitors"
        },
        {
            "id": 18,
            "name": "Argos"
        },
        {
            "id": 19,
            "name": "the Odyssey"
        }
    ],
    "entity_statements": {
        "0": [
            0,
            1,
            3,
            4,
            5,
            9,
            10,
            11,
            12,
            13,
            16,
            17,
            18,
            19
        ],
        "1": [
            7,
            14,
            19,
            25
        ],
        "2": [
            6,
            8,
            15,
            18,
            25
        ],
        "3": [
            5,
            6,
            16,
            18,
            25
        ],
        "4": [
            2,
            5
        ],
        "5": [
            4,
            20
        ],
        "6": [
            11,
            20
        ],
        "7": [
            2,
            3
        ],
        "8": [
            12,
            21
        ],
        "9": [
            13,
            21
        ],
        "10": [
            13,
            21
        ],
        "11": [
            9,
            22
        ],
        "12": [
            9,
            10,
            22
        ],
        "13": [
            0,
            4,
            5,
            6,
            8,
            15,
            16,
            17,
            23,
            24,
            25,
            26,
            27
        ],
        "14": [
            0,
            1,
            10,
            27
        ],
        "15": [
            9,
            10,
            22
        ],
        "16": [
            7,
            15,
            23
        ],
        "17": [
            6,
            7,
            8,
            14,
            16,
            18,
            19,
            26
        ],
        "18": [
            17,
            24
        ],
        "19": [
            0,
            10,
            25,
            27
        ]
    }
}