{
    "statements": [
        {
            "id": 0,
            "text": "Nazi Germany invaded Poland in 1939, prompting the Allied powers to declare war."
        },
        {
            "id": 1,
            "text": "The Axis powers formed around Nazi Germany, Italy, and Japan, opposing the Allied powers."
        },
        {
            "id": 2,
            "text": "The United Kingdom endured months of bombing in the Blitz by Nazi Germany."
        },
        {
            "id": 3,
            "text": "The Soviet Union signed a nonaggression pact with Nazi Germany shortly before the invasion."
        },
        {
            "id": 4,
            "text": "The United States initially stayed neutral, supplying material aid to the Allied powers."
        },
        {
            "id": 5,
            "text": "Japan expanded across East Asia and the Pacific as a member of the Axis powers."
        },
        {
            "id": 6,
            "text": "The Battle of Britain saw the United Kingdom resist intense air attacks from Nazi Germany."
        },
        {
            "id": 7,
            "text": "Allied powers coordinated strategy in meetings between the United States and the United Kingdom."
        },
        {
            "id": 8,
            "text": "The Soviet Union suffered enormous casualties while pushing Nazi Germany back on the Eastern Front."
        },
        {
            "id": 9,
            "text": "In North Africa, Axis powers fought Allied forces for control of vital Mediterranean supply routes."
        },
        {
            "id": 10,
            "text": "Japan attacked Pearl Harbor in 1941, bringing the United States fully into World War II."
        },
        {
            "id": 11,
            "text": "Following Pearl Harbor, the United States, United Kingdom, and Soviet Union opposed the Axis powers."
        },
        {
            "id": 12,
            "text": "The United States became an industrial arsenal for the Allied powers, producing ships and aircraft."
        },
        {
            "id": 13,
            "text": "The United Kingdom relied on convoys as Nazi Germany used submarines to cut Allied shipping."
        },
        {
            "id": 14,
            "text": "On the Eastern Front, the Soviet Union launched large offensives that steadily weakened Nazi Germany."
        },
        {
            "id": 15,
            "text": "In the Pacific theater, the United States advanced toward Japan while Allied powers fought elsewhere."
        },
        {
            "id": 16,
            "text": "Japan's occupation policies in Asia imposed harsh rule, provoking resistance movements and complicating Allied planning."
        },
        {
            "id": 17,
            "text": "The Axis powers lost momentum as setbacks in North Africa and the Soviet Union mounted."
        },
        {
            "id": 18,
            "text": "Allied powers used strategic bombing against Nazi Germany and Japan to damage industry and infrastructure."
        },
        {
            "id": 19,
            "text": "The Soviet Union's victory at Stalingrad marked a decisive turning point against Nazi Germany."
        },
        {
            "id": 20,
            "text": "The United States and United Kingdom coordinated landings in Europe to open fronts against Nazi Germany."
        },
        {
            "id": 21,
            "text": "Italy's surrender weakened the Axis powers in Europe, forcing Nazi Germany to defend longer coastlines."
        },
        {
            "id": 22,
            "text": "Japan suffered major naval defeats in the Pacific as the United States gained carrier superiority."
        },
        {
            "id": 23,
            "text": "Within the Allied powers, disagreements still arose over postwar boundaries and influence in Eastern Europe."
        },
        {
            "id": 24,
            "text": "The Soviet Union advanced into Eastern Europe, while Allied powers pushed westward toward Nazi Germany."
        },
        {
            "id": 25,
            "text": "As Axis powers collapsed, many occupied territories regained formal governments under Allied supervision or influence."
        },
        {
            "id": 26,
            "text": "Japan faced bombing and naval blockade by the United States in the final months."
        },
        {
            "id": 27,
            "text": "The United Kingdom emerged victorious but economically strained compared with the United States."
        },
        {
            "id": 28,
            "text": "The Soviet Union extended influence over Eastern Europe after defeating Nazi Germany."
        },
        {
            "id": 29,
            "text": "The United States became a leading global power as Nazi Germany and Japan were defeated."
        },
        {
            "id": 30,
            "text": "War crimes trials by Allied powers prosecuted leaders from Nazi Germany and Japan."
        },
        {
            "id": 31,
            "text": "The Axis powers left devastated cities and displaced populations across Europe and parts of Asia."
        },
        {
            "id": 32,
            "text": "Allied powers promoted new international institutions, with the United States playing a central organizing role."
        },
        {
            "id": 33,
            "text": "Nazi Germany's defeat ended its regime, while the Soviet Union solidified control nearby."
        },
        {
            "id": 34,
            "text": "Japan's surrender followed the atomic bombings and Soviet entry into the war in Asia."
        },
        {
            "id": 35,
            "text": "The United Kingdom, United States, and Soviet Union emerged as central actors in postwar diplomacy."
        },
        {
            "id": 36,
            "text": "World War II reshaped power, with the United States and Soviet Union becoming superpowers."
        },
        {
            "id": 37,
            "text": "Allied powers helped establish the United Nations as a forum to prevent future global conflicts."
        },
        {
            "id": 38,
            "text": "The Axis powers were dissolved as military alliances, leaving their former members occupied or closely monitored."
        },
        {
            "id": 39,
            "text": "World War II's devastation encouraged cooperation between former Allied powers despite ideological tensions."
        }
    ],
    "entities": [
        {
            "id": 0,
            "name": "Nazi Germany"
        },
        {
            "id": 1,
            "name": "Allied powers"
        },
        {
            "id": 2,
            "name": "Axis powers"
        },
        {
            "id": 3,
            "name": "Soviet Union"
        },
        {
            "id": 4,
            "name": "United States"
        },
        {
            "id": 5,
            "name": "United Kingdom"
        },
        {
            "id": 6,
            "name": "Japan"
        }
    ],
    "entity_statements": {
        "0": [
            0,
            1,
            2,
            3,
            6,
            8,
            13,
            14,
            18,
            19,
            20,
            21,
            24,
            28,
            29,
            30,
            33
        ],
        "1": [
            0,
            1,
            4,
            7,
            9,
            12,
            13,
            15,
            16,
            18,
            23,
            24,
            25,
            30,
            32,
            37,
            39
        ],
        "2": [
            1,
            5,
            9,
            11,
            17,
            21,
            25,
            31,
            38
        ],
        "3": [
            3,
            8,
            11,
            14,
            17,
            19,
            24,
            28,
            33,
            34,
            35,
            36
        ],
        "4": [
            4,
            7,
            10,
            11,
            12,
            15,
            20,
            22,
            26,
            27,
            29,
            32,
            35,
            36
        ],
        "5": [
            2,
            6,
            7,
            11,
            13,
            20,
            27,
            35
        ],
        "6": [
            1,
            5,
            10,
            15,
            16,
            18,
            22,
            26,
            29,
            30,
            34
        ]
    }
}